namespace Course02_Algorithm
{
    class BigO
    {
        public void Run()
        {

            /*
             * O(N) -> 시간복잡도가 데이터의 갯수와 비례하게 실행 시간이 증가한다.
             * 시간복잡도는 보통 최악의 경우를 기준으로 분석한다.
             * 
             * 
             * 로그 시간(O(log n))은 입력 크기 n을 반복적으로 일정 비율(보통 2)로 나누어 문제를 해결할 때,
             * 반복 횟수와 연산량이 입력 크기의 로그에 비례한다는 의미입니다. 
             * 예를 들어 이진 탐색에서는 배열을 매번 반으로 쪼개면서 값을 찾기 때문에 (업앤다운 게임),
             * 배열 크기가 n이면 최악의 경우 비교 횟수는 log₂(n)번만 필요합니다. 
             * 즉, 로그는 “문제를 몇 번 나눠야 최종 해결 가능한가”를 나타내며, 
             * 입력이 커져도 연산량이 천천히 증가하기 때문에 매우 효율적입니다.
             */
        }
    }
}
